irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_i2c_3587_IUT.c
    RCC_APB1PeriphResetCmd(((uint32_t)0x00200000), DISABLE);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable542,538) 

    
    CS_CMM_PROBE_NODE_STMT(117,4,3) RCC_APB1PeriphResetCmd(((uint32_t)0x00400000), ENABLE);

    RCC_APB1PeriphResetCmd(((uint32_t)0x00400000), DISABLE);
  }

CS_CMM_PROBE_NODE_STMT(117,3,4) 
 CODESCROLL_FUNC_END(191, 14, 180) } CODESCROLL_FUNC_END_RBRACE 
/* # 190 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_i2c.c"*/
void I2C_Init(I2C_TypeDef* I2Cx, I2C_InitTypeDef* I2C_InitStruct)
{ CODESCROLL_FUNC_BEGIN(192, (192, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable543,539) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable544,117,2,0)

  uint16_t tmpreg = 0, freqrange = 0;
  uint16_t result = 0x04;
  uint32_t pclk1 = 8000000;
  RCC_ClocksTypeDef rcc_clocks;

  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);



  tmpreg = I2Cx->CR2;

  tmpreg &= ((uint16_t)0xFFC0);

  RCC_GetClocksFreq(&rcc_clocks);
  pclk1 = rcc_clocks.PCLK1_Frequency;

  freqrange = (uint16_t)(pclk1 / 1000000);
  tmpreg |= freqrange;

  I2Cx->CR2 = tmpreg;



  I2Cx->CR1 &= ((uint16_t)0xFFFE);


  tmpreg = 0;


  
  CS_CMM_PROBE_NODE_STMT(117,1,1) if (I2C_InitStruct->I2C_ClockSpeed <= 100000)
  {

    
    CS_CMM_PROBE_NODE_STMT(117,0,2) result = (uint16_t)(pclk1 / (I2C_InitStruct->I2C_ClockSpeed << 1));

    
    CS_CMM_PROBE_NODE_STMT(118,7,3) if (result < 0x04)
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable545,540) 

      
      CS_CMM_PROBE_NODE_STMT(118,6,4) result = 0x04;
    } CS_CMM_ELSE_PROBE_C1(541) 

    
    CS_CMM_PROBE_NODE_STMT(118,5,5) tmpreg |= result;

    I2Cx->TRISE = freqrange + 1;
  }

  else
  {
    
    CS_CMM_PROBE_NODE_STMT(118,4,6) if (I2C_InitStruct->I2C_DutyCycle == ((uint16_t)0xBFFF))
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable546,542) 

      
      CS_CMM_PROBE_NODE_STMT(118,3,7) result = (uint16_t)(pclk1 / (I2C_InitStruct->I2C_ClockSpeed * 3));
    }
    else
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable547,543) 

      
      CS_CMM_PROBE_NODE_STMT(118,2,8) result = (uint16_t)(pclk1 / (I2C_InitStruct->I2C_ClockSpeed * 25));

      result |= ((uint16_t)0x4000);
    }


    
    CS_CMM_PROBE_NODE_STMT(118,1,9) if ((result & ((uint16_t)0x0FFF)) == 0)
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable548,544) 

      
      CS_CMM_PROBE_NODE_STMT(118,0,10) result |= (uint16_t)0x0001;
    } CS_CMM_ELSE_PROBE_C1(545) 

    
    CS_CMM_PROBE_NODE_STMT(119,7,11) tmpreg |= (uint16_t)(result | ((uint16_t)0x8000));

    I2Cx->TRISE = (uint16_t)(((freqrange * (uint16_t)300) / (uint16_t)1000) + (uint16_t)1);
  }


  
  CS_CMM_PROBE_NODE_STMT(119,6,12) I2Cx->CCR = tmpreg;

  I2Cx->CR1 |= ((uint16_t)0x0001);



  tmpreg = I2Cx->CR1;

  tmpreg &= ((uint16_t)0xFBF5);



  tmpreg |= (uint16_t)((uint32_t)I2C_InitStruct->I2C_Mode | I2C_InitStruct->I2C_Ack);

  I2Cx->CR1 = tmpreg;



  I2Cx->OAR1 = (I2C_InitStruct->I2C_AcknowledgedAddress | I2C_InitStruct->I2C_OwnAddress1);

CS_CMM_PROBE_NODE_STMT(119,5,13) 
 CODESCROLL_FUNC_END(192, 14, 290) } CODESCROLL_FUNC_END_RBRACE 






void I2C_StructInit(I2C_InitTypeDef* I2C_InitStruct)
{ CODESCROLL_FUNC_BEGIN(193, (193, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable549,546) 


  
  CS_CMM_PROBE_NODE_STMT(119,4,0) I2C_InitStruct->I2C_ClockSpeed = 5000;

  I2C_InitStruct->I2C_Mode = ((uint16_t)0x0000);

  I2C_InitStruct->I2C_DutyCycle = ((uint16_t)0xBFFF);

  I2C_InitStruct->I2C_OwnAddress1 = 0;

  I2C_InitStruct->I2C_Ack = ((uint16_t)0x0000);

  I2C_InitStruct->I2C_AcknowledgedAddress = ((uint16_t)0x4000);

CS_CMM_PROBE_NODE_STMT(119,3,1) 
 CODESCROLL_FUNC_END(193, 14, 312) } CODESCROLL_FUNC_END_RBRACE 
/* # 321 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_i2c.c"*/
void I2C_Cmd(I2C_TypeDef* I2Cx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(194, (194, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable550,547) 

  
  CS_CMM_PROBE_NODE_STMT(119,2,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(119,1,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable551,548) 

    
    CS_CMM_PROBE_NODE_STMT(119,0,2) I2Cx->CR1 |= ((uint16_t)0x0001);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable552,549) 

    
    CS_CMM_PROBE_NODE_STMT(120,7,3) I2Cx->CR1 &= ((uint16_t)0xFFFE);
  }

CS_CMM_PROBE_NODE_STMT(120,6,4) 
 CODESCROLL_FUNC_END(194, 14, 336) } CODESCROLL_FUNC_END_RBRACE 
/* # 345 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_i2c.c"*/
void I2C_DMACmd(I2C_TypeDef* I2Cx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(195, (195, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable553,550) 

  
  CS_CMM_PROBE_NODE_STMT(120,5,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(120,4,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable554,551) 

    
    CS_CMM_PROBE_NODE_STMT(120,3,2) I2Cx->CR2 |= ((uint16_t)0x0800);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable555,552) 

    
    CS_CMM_PROBE_NODE_STMT(120,2,3) I2Cx->CR2 &= ((uint16_t)0xF7FF);
  }

CS_CMM_PROBE_NODE_STMT(120,1,4) 
 CODESCROLL_FUNC_END(195, 14, 360) } CODESCROLL_FUNC_END_RBRACE 
/* # 369 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_i2c.c"*/
void I2C_DMALastTransferCmd(I2C_TypeDef* I2Cx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(196, (196, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable556,553) 

  
  CS_CMM_PROBE_NODE_STMT(120,0,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(121,7,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable557,554) 

    
    CS_CMM_PROBE_NODE_STMT(121,6,2) I2Cx->CR2 |= ((uint16_t)0x1000);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable558,555) 

    
    CS_CMM_PROBE_NODE_STMT(121,5,3) I2Cx->CR2 &= ((uint16_t)0xEFFF);
  }

CS_CMM_PROBE_NODE_STMT(121,4,4) 
 CODESCROLL_FUNC_END(196, 14, 384) } CODESCROLL_FUNC_END_RBRACE 
/* # 393 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_i2c.c"*/
void I2C_GenerateSTART(I2C_TypeDef* I2Cx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(197, (197, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable559,556) 

  
  CS_CMM_PROBE_NODE_STMT(121,3,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(121,2,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable560,557) 

    
    CS_CMM_PROBE_NODE_STMT(121,1,2) I2Cx->CR1 |= ((uint16_t)0x0100);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable561,558) 

    
    CS_CMM_PROBE_NODE_STMT(121,0,3) I2Cx->CR1 &= ((uint16_t)0xFEFF);
  }

CS_CMM_PROBE_NODE_STMT(122,7,4) 
 CODESCROLL_FUNC_END(197, 14, 408) } CODESCROLL_FUNC_END_RBRACE 
/* # 417 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_i2c.c"*/
void I2C_GenerateSTOP(I2C_TypeDef* I2Cx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(198, (198, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable562,559) 

  
