irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_i2c_3587_IUT.c
  CS_CMM_PROBE_NODE_STMT(122,6,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(122,5,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable563,560) 

    
    CS_CMM_PROBE_NODE_STMT(122,4,2) I2Cx->CR1 |= ((uint16_t)0x0200);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable564,561) 

    
    CS_CMM_PROBE_NODE_STMT(122,3,3) I2Cx->CR1 &= ((uint16_t)0xFDFF);
  }

CS_CMM_PROBE_NODE_STMT(122,2,4) 
 CODESCROLL_FUNC_END(198, 14, 432) } CODESCROLL_FUNC_END_RBRACE 
/* # 441 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_i2c.c"*/
void I2C_AcknowledgeConfig(I2C_TypeDef* I2Cx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(199, (199, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable565,562) 

  
  CS_CMM_PROBE_NODE_STMT(122,1,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(122,0,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable566,563) 

    
    CS_CMM_PROBE_NODE_STMT(123,7,2) I2Cx->CR1 |= ((uint16_t)0x0400);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable567,564) 

    
    CS_CMM_PROBE_NODE_STMT(123,6,3) I2Cx->CR1 &= ((uint16_t)0xFBFF);
  }

CS_CMM_PROBE_NODE_STMT(123,5,4) 
 CODESCROLL_FUNC_END(199, 14, 456) } CODESCROLL_FUNC_END_RBRACE 







void I2C_OwnAddress2Config(I2C_TypeDef* I2Cx, uint8_t Address)
{ CODESCROLL_FUNC_BEGIN(200, (200, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable568,565) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable569,123,4,0)

  uint16_t tmpreg = 0;


  ((void)0);


  tmpreg = I2Cx->OAR2;


  tmpreg &= ((uint16_t)0xFF01);


  tmpreg |= (uint16_t)((uint16_t)Address & (uint16_t)0x00FE);


  I2Cx->OAR2 = tmpreg;

CS_CMM_PROBE_NODE_STMT(123,3,1) 
 CODESCROLL_FUNC_END(200, 14, 482) } CODESCROLL_FUNC_END_RBRACE 
/* # 491 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_i2c.c"*/
void I2C_DualAddressCmd(I2C_TypeDef* I2Cx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(201, (201, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable570,566) 

  
  CS_CMM_PROBE_NODE_STMT(123,2,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(123,1,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable571,567) 

    
    CS_CMM_PROBE_NODE_STMT(123,0,2) I2Cx->OAR2 |= ((uint16_t)0x0001);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable572,568) 

    
    CS_CMM_PROBE_NODE_STMT(124,7,3) I2Cx->OAR2 &= ((uint16_t)0xFFFE);
  }

CS_CMM_PROBE_NODE_STMT(124,6,4) 
 CODESCROLL_FUNC_END(201, 14, 506) } CODESCROLL_FUNC_END_RBRACE 
/* # 515 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_i2c.c"*/
void I2C_GeneralCallCmd(I2C_TypeDef* I2Cx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(202, (202, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable573,569) 

  
  CS_CMM_PROBE_NODE_STMT(124,5,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(124,4,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable574,570) 

    
    CS_CMM_PROBE_NODE_STMT(124,3,2) I2Cx->CR1 |= ((uint16_t)0x0040);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable575,571) 

    
    CS_CMM_PROBE_NODE_STMT(124,2,3) I2Cx->CR1 &= ((uint16_t)0xFFBF);
  }

CS_CMM_PROBE_NODE_STMT(124,1,4) 
 CODESCROLL_FUNC_END(202, 14, 530) } CODESCROLL_FUNC_END_RBRACE 
/* # 544 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_i2c.c"*/
void I2C_ITConfig(I2C_TypeDef* I2Cx, uint16_t I2C_IT, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(203, (203, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable576,572) 

  
  CS_CMM_PROBE_NODE_STMT(124,0,0) ((void)0);
  ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(125,7,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable577,573) 

    
    CS_CMM_PROBE_NODE_STMT(125,6,2) I2Cx->CR2 |= I2C_IT;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable578,574) 

    
    CS_CMM_PROBE_NODE_STMT(125,5,3) I2Cx->CR2 &= (uint16_t)~I2C_IT;
  }

CS_CMM_PROBE_NODE_STMT(125,4,4) 
 CODESCROLL_FUNC_END(203, 14, 561) } CODESCROLL_FUNC_END_RBRACE 







void I2C_SendData(I2C_TypeDef* I2Cx, uint8_t Data)
{ CODESCROLL_FUNC_BEGIN(204, (204, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable579,575) 

  
  CS_CMM_PROBE_NODE_STMT(125,3,0) ((void)0);

  I2Cx->DR = Data;

CS_CMM_PROBE_NODE_STMT(125,2,1) 
 CODESCROLL_FUNC_END(204, 14, 575) } CODESCROLL_FUNC_END_RBRACE 






uint8_t I2C_ReceiveData(I2C_TypeDef* I2Cx)
{ CODESCROLL_FUNC_BEGIN(205, (205, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable580,576) 

  
  CS_CMM_PROBE_NODE_STMT(125,1,0) ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(125,0,1) 
   CODESCROLL_FUNC_END(205, 14, 587) return (uint8_t)I2Cx->DR;
} CODESCROLL_FUNC_END_RBRACE 
/* # 600 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_i2c.c"*/
void I2C_Send7bitAddress(I2C_TypeDef* I2Cx, uint8_t Address, uint8_t I2C_Direction)
{ CODESCROLL_FUNC_BEGIN(206, (206, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable581,577) 

  
  CS_CMM_PROBE_NODE_STMT(126,7,0) ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(126,6,1) if (I2C_Direction != ((uint8_t)0x00))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable582,578) 

    
    CS_CMM_PROBE_NODE_STMT(126,5,2) Address |= ((uint16_t)0x0001);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable583,579) 

    
    CS_CMM_PROBE_NODE_STMT(126,4,3) Address &= ((uint16_t)0xFFFE);
  }

  
  CS_CMM_PROBE_NODE_STMT(126,3,4) I2Cx->DR = Address;

CS_CMM_PROBE_NODE_STMT(126,2,5) 
 CODESCROLL_FUNC_END(206, 14, 618) } CODESCROLL_FUNC_END_RBRACE 
/* # 635 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_i2c.c"*/
uint16_t I2C_ReadRegister(I2C_TypeDef* I2Cx, uint8_t I2C_Register)
{ CODESCROLL_FUNC_BEGIN(207, (207, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable584,580) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable585,126,1,0)

  volatile uint32_t tmp = 0;


  ((void)0);
  ((void)0);

  tmp = (uint32_t) I2Cx;
  tmp += I2C_Register;


  
  CS_CMM_PROBE_NODE_STMT(126,0,1) 
   CODESCROLL_FUNC_END(207, 14, 647) return (*(volatile uint16_t *) tmp);
} CODESCROLL_FUNC_END_RBRACE 
/* # 657 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_i2c.c"*/
void I2C_SoftwareResetCmd(I2C_TypeDef* I2Cx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(208, (208, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable586,581) 

  
