irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_i2c_3587_IUT.c
  CS_CMM_PROBE_NODE_STMT(127,7,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(127,6,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable587,582) 

    
    CS_CMM_PROBE_NODE_STMT(127,5,2) I2Cx->CR1 |= ((uint16_t)0x8000);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable588,583) 

    
    CS_CMM_PROBE_NODE_STMT(127,4,3) I2Cx->CR1 &= ((uint16_t)0x7FFF);
  }

CS_CMM_PROBE_NODE_STMT(127,3,4) 
 CODESCROLL_FUNC_END(208, 14, 672) } CODESCROLL_FUNC_END_RBRACE 
/* # 683 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_i2c.c"*/
void I2C_SMBusAlertConfig(I2C_TypeDef* I2Cx, uint16_t I2C_SMBusAlert)
{ CODESCROLL_FUNC_BEGIN(209, (209, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable589,584) 

  
  CS_CMM_PROBE_NODE_STMT(127,2,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(127,1,1) if (I2C_SMBusAlert == ((uint16_t)0x2000))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable590,585) 

    
    CS_CMM_PROBE_NODE_STMT(127,0,2) I2Cx->CR1 |= ((uint16_t)0x2000);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable591,586) 

    
    CS_CMM_PROBE_NODE_STMT(128,7,3) I2Cx->CR1 &= ((uint16_t)0xDFFF);
  }

CS_CMM_PROBE_NODE_STMT(128,6,4) 
 CODESCROLL_FUNC_END(209, 14, 698) } CODESCROLL_FUNC_END_RBRACE 
/* # 707 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_i2c.c"*/
void I2C_TransmitPEC(I2C_TypeDef* I2Cx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(210, (210, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable592,587) 

  
  CS_CMM_PROBE_NODE_STMT(128,5,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(128,4,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable593,588) 

    
    CS_CMM_PROBE_NODE_STMT(128,3,2) I2Cx->CR1 |= ((uint16_t)0x1000);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable594,589) 

    
    CS_CMM_PROBE_NODE_STMT(128,2,3) I2Cx->CR1 &= ((uint16_t)0xEFFF);
  }

CS_CMM_PROBE_NODE_STMT(128,1,4) 
 CODESCROLL_FUNC_END(210, 14, 722) } CODESCROLL_FUNC_END_RBRACE 
/* # 733 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_i2c.c"*/
void I2C_PECPositionConfig(I2C_TypeDef* I2Cx, uint16_t I2C_PECPosition)
{ CODESCROLL_FUNC_BEGIN(211, (211, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable595,590) 

  
  CS_CMM_PROBE_NODE_STMT(128,0,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(129,7,1) if (I2C_PECPosition == ((uint16_t)0x0800))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable596,591) 

    
    CS_CMM_PROBE_NODE_STMT(129,6,2) I2Cx->CR1 |= ((uint16_t)0x0800);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable597,592) 

    
    CS_CMM_PROBE_NODE_STMT(129,5,3) I2Cx->CR1 &= ((uint16_t)0xF7FF);
  }

CS_CMM_PROBE_NODE_STMT(129,4,4) 
 CODESCROLL_FUNC_END(211, 14, 748) } CODESCROLL_FUNC_END_RBRACE 
/* # 757 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_i2c.c"*/
void I2C_CalculatePEC(I2C_TypeDef* I2Cx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(212, (212, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable598,593) 

  
  CS_CMM_PROBE_NODE_STMT(129,3,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(129,2,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable599,594) 

    
    CS_CMM_PROBE_NODE_STMT(129,1,2) I2Cx->CR1 |= ((uint16_t)0x0020);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable600,595) 

    
    CS_CMM_PROBE_NODE_STMT(129,0,3) I2Cx->CR1 &= ((uint16_t)0xFFDF);
  }

CS_CMM_PROBE_NODE_STMT(130,7,4) 
 CODESCROLL_FUNC_END(212, 14, 772) } CODESCROLL_FUNC_END_RBRACE 






uint8_t I2C_GetPEC(I2C_TypeDef* I2Cx)
{ CODESCROLL_FUNC_BEGIN(213, (213, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable601,596) 

  
  CS_CMM_PROBE_NODE_STMT(130,6,0) ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(130,5,1) 
   CODESCROLL_FUNC_END(213, 14, 784) return ((I2Cx->SR2) >> 8);
} CODESCROLL_FUNC_END_RBRACE 
/* # 794 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_i2c.c"*/
void I2C_ARPCmd(I2C_TypeDef* I2Cx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(214, (214, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable602,597) 

  
  CS_CMM_PROBE_NODE_STMT(130,4,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(130,3,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable603,598) 

    
    CS_CMM_PROBE_NODE_STMT(130,2,2) I2Cx->CR1 |= ((uint16_t)0x0010);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable604,599) 

    
    CS_CMM_PROBE_NODE_STMT(130,1,3) I2Cx->CR1 &= ((uint16_t)0xFFEF);
  }

CS_CMM_PROBE_NODE_STMT(130,0,4) 
 CODESCROLL_FUNC_END(214, 14, 809) } CODESCROLL_FUNC_END_RBRACE 
/* # 818 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_i2c.c"*/
void I2C_StretchClockCmd(I2C_TypeDef* I2Cx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(215, (215, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable605,600) 

  
  CS_CMM_PROBE_NODE_STMT(131,7,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(131,6,1) if (NewState == DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable606,601) 

    
    CS_CMM_PROBE_NODE_STMT(131,5,2) I2Cx->CR1 |= ((uint16_t)0x0080);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable607,602) 

    
    CS_CMM_PROBE_NODE_STMT(131,4,3) I2Cx->CR1 &= ((uint16_t)0xFF7F);
  }

CS_CMM_PROBE_NODE_STMT(131,3,4) 
 CODESCROLL_FUNC_END(215, 14, 833) } CODESCROLL_FUNC_END_RBRACE 
/* # 844 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_i2c.c"*/
void I2C_FastModeDutyCycleConfig(I2C_TypeDef* I2Cx, uint16_t I2C_DutyCycle)
{ CODESCROLL_FUNC_BEGIN(216, (216, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable608,603) 

  
  CS_CMM_PROBE_NODE_STMT(131,2,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(131,1,1) if (I2C_DutyCycle != ((uint16_t)0x4000))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable609,604) 

    
    CS_CMM_PROBE_NODE_STMT(131,0,2) I2Cx->CCR &= ((uint16_t)0xBFFF);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable610,605) 

    
    CS_CMM_PROBE_NODE_STMT(132,7,3) I2Cx->CCR |= ((uint16_t)0x4000);
  }

CS_CMM_PROBE_NODE_STMT(132,6,4) 
 CODESCROLL_FUNC_END(216, 14, 859) } CODESCROLL_FUNC_END_RBRACE 
/* # 984 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_i2c.c"*/
ErrorStatus I2C_CheckEvent(I2C_TypeDef* I2Cx, uint32_t I2C_EVENT)
{ CODESCROLL_FUNC_BEGIN(217, (217, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable611,606) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable612,132,5,0)

  uint32_t lastevent = 0;
  uint32_t flag1 = 0, flag2 = 0;
  ErrorStatus status = ERROR;


  ((void)0);
  ((void)0);


  flag1 = I2Cx->SR1;
  flag2 = I2Cx->SR2;
  flag2 = flag2 << 16;


  lastevent = (flag1 | flag2) & ((uint32_t)0x00FFFFFF);


  
  CS_CMM_PROBE_NODE_STMT(132,4,1) if ((lastevent & I2C_EVENT) == I2C_EVENT)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable613,607) 

    
