irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_i2c_3587_IUT.c
    CS_CMM_PROBE_NODE_STMT(132,3,2) status = SUCCESS;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable614,608) 

    
    CS_CMM_PROBE_NODE_STMT(132,2,3) status = ERROR;
  }

  
  CS_CMM_PROBE_NODE_STMT(132,1,4) 
   CODESCROLL_FUNC_END(217, 14, 1014) return status;
} CODESCROLL_FUNC_END_RBRACE 
/* # 1032 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_i2c.c"*/
uint32_t I2C_GetLastEvent(I2C_TypeDef* I2Cx)
{ CODESCROLL_FUNC_BEGIN(218, (218, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable615,609) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable616,132,0,0)

  uint32_t lastevent = 0;
  uint32_t flag1 = 0, flag2 = 0;


  ((void)0);


  flag1 = I2Cx->SR1;
  flag2 = I2Cx->SR2;
  flag2 = flag2 << 16;


  lastevent = (flag1 | flag2) & ((uint32_t)0x00FFFFFF);


  
  CS_CMM_PROBE_NODE_STMT(133,7,1) 
   CODESCROLL_FUNC_END(218, 14, 1049) return lastevent;
} CODESCROLL_FUNC_END_RBRACE 
/* # 1087 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_i2c.c"*/
FlagStatus I2C_GetFlagStatus(I2C_TypeDef* I2Cx, uint32_t I2C_FLAG)
{ CODESCROLL_FUNC_BEGIN(219, (219, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable617,610) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable618,133,6,0)

  FlagStatus bitstatus = RESET;
  volatile uint32_t i2creg = 0, i2cxbase = 0;


  ((void)0);
  ((void)0);


  i2cxbase = (uint32_t)I2Cx;


  i2creg = I2C_FLAG >> 28;


  I2C_FLAG &= ((uint32_t)0x00FFFFFF);

  
  CS_CMM_PROBE_NODE_STMT(133,5,1) if(i2creg != 0)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable619,611) 

    
    CS_CMM_PROBE_NODE_STMT(133,4,2) i2cxbase += 0x14;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable620,612) 

    
    CS_CMM_PROBE_NODE_STMT(133,3,3) I2C_FLAG = (uint32_t)(I2C_FLAG >> 16);

    i2cxbase += 0x18;
  }

  
  CS_CMM_PROBE_NODE_STMT(133,2,4) if(((*(volatile uint32_t *)i2cxbase) & I2C_FLAG) != (uint32_t)RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable621,613) 

    
    CS_CMM_PROBE_NODE_STMT(133,1,5) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable622,614) 

    
    CS_CMM_PROBE_NODE_STMT(133,0,6) bitstatus = RESET;
  }


  
  CS_CMM_PROBE_NODE_STMT(134,7,7) 
   CODESCROLL_FUNC_END(219, 14, 1130) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 1166 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_i2c.c"*/
void I2C_ClearFlag(I2C_TypeDef* I2Cx, uint32_t I2C_FLAG)
{ CODESCROLL_FUNC_BEGIN(220, (220, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable623,615) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable624,134,6,0)

  uint32_t flagpos = 0;

  ((void)0);
  ((void)0);

  flagpos = I2C_FLAG & ((uint32_t)0x00FFFFFF);

  I2Cx->SR1 = (uint16_t)~flagpos;

CS_CMM_PROBE_NODE_STMT(134,5,1) 
 CODESCROLL_FUNC_END(220, 14, 1176) } CODESCROLL_FUNC_END_RBRACE 
/* # 1200 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_i2c.c"*/
ITStatus I2C_GetITStatus(I2C_TypeDef* I2Cx, uint32_t I2C_IT)
{ CODESCROLL_FUNC_BEGIN(221, (221, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable625,616) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable626,134,4,0)

  ITStatus bitstatus = RESET;
  uint32_t enablestatus = 0;


  ((void)0);
  ((void)0);


  enablestatus = (uint32_t)(((I2C_IT & ((uint32_t)0x07000000)) >> 16) & (I2Cx->CR2)) ;


  I2C_IT &= ((uint32_t)0x00FFFFFF);


  
  CS_CMM_PROBE_NODE_STMT(134,3,1) if (CS_MCDC_221_0(((I2Cx->SR1 & I2C_IT) != (uint32_t)RESET), enablestatus, 36))
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable627,24) 

    
    CS_CMM_PROBE_NODE_STMT(134,2,2) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable628,25) 

    
    CS_CMM_PROBE_NODE_STMT(134,1,3) bitstatus = RESET;
  }

  
  CS_CMM_PROBE_NODE_STMT(134,0,4) 
   CODESCROLL_FUNC_END(221, 14, 1227) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 1261 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_i2c.c"*/
void I2C_ClearITPendingBit(I2C_TypeDef* I2Cx, uint32_t I2C_IT)
{ CODESCROLL_FUNC_BEGIN(222, (222, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable629,617) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable630,135,7,0)

  uint32_t flagpos = 0;

  ((void)0);
  ((void)0);

  flagpos = I2C_IT & ((uint32_t)0x00FFFFFF);

  I2Cx->SR1 = (uint16_t)~flagpos;

CS_CMM_PROBE_NODE_STMT(135,6,1) 
 CODESCROLL_FUNC_END(222, 14, 1271) } CODESCROLL_FUNC_END_RBRACE 
